###############################################################################
# Created by write_sdc
###############################################################################
current_design floatingPointAdder
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 20.0000 
set_clock_latency 0.2000 [get_clocks {__VIRTUAL_CLK__}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[0]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[10]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[11]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[12]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[13]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[14]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[15]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[16]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[17]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[18]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[19]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[1]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[20]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[21]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[22]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[23]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[24]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[25]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[26]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[27]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[28]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[29]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[2]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[30]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[31]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[3]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[4]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[5]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[6]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[7]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[8]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {x[9]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[0]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[10]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[11]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[12]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[13]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[14]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[15]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[16]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[17]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[18]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[19]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[1]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[20]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[21]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[22]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[23]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[24]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[25]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[26]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[27]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[28]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[29]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[2]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[30]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[31]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[3]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[4]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[5]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[6]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[7]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[8]}]
set_input_delay 1.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {y[9]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[0]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[10]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[11]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[12]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[13]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[14]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[15]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[16]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[17]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[18]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[19]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[1]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[20]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[21]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[22]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[23]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[24]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[25]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[26]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[27]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[28]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[29]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[2]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[30]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[31]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[3]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[4]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[5]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[6]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[7]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[8]}]
set_output_delay 0.5000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {result[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0100 [get_ports {result[31]}]
set_load -pin_load 0.0100 [get_ports {result[30]}]
set_load -pin_load 0.0100 [get_ports {result[29]}]
set_load -pin_load 0.0100 [get_ports {result[28]}]
set_load -pin_load 0.0100 [get_ports {result[27]}]
set_load -pin_load 0.0100 [get_ports {result[26]}]
set_load -pin_load 0.0100 [get_ports {result[25]}]
set_load -pin_load 0.0100 [get_ports {result[24]}]
set_load -pin_load 0.0100 [get_ports {result[23]}]
set_load -pin_load 0.0100 [get_ports {result[22]}]
set_load -pin_load 0.0100 [get_ports {result[21]}]
set_load -pin_load 0.0100 [get_ports {result[20]}]
set_load -pin_load 0.0100 [get_ports {result[19]}]
set_load -pin_load 0.0100 [get_ports {result[18]}]
set_load -pin_load 0.0100 [get_ports {result[17]}]
set_load -pin_load 0.0100 [get_ports {result[16]}]
set_load -pin_load 0.0100 [get_ports {result[15]}]
set_load -pin_load 0.0100 [get_ports {result[14]}]
set_load -pin_load 0.0100 [get_ports {result[13]}]
set_load -pin_load 0.0100 [get_ports {result[12]}]
set_load -pin_load 0.0100 [get_ports {result[11]}]
set_load -pin_load 0.0100 [get_ports {result[10]}]
set_load -pin_load 0.0100 [get_ports {result[9]}]
set_load -pin_load 0.0100 [get_ports {result[8]}]
set_load -pin_load 0.0100 [get_ports {result[7]}]
set_load -pin_load 0.0100 [get_ports {result[6]}]
set_load -pin_load 0.0100 [get_ports {result[5]}]
set_load -pin_load 0.0100 [get_ports {result[4]}]
set_load -pin_load 0.0100 [get_ports {result[3]}]
set_load -pin_load 0.0100 [get_ports {result[2]}]
set_load -pin_load 0.0100 [get_ports {result[1]}]
set_load -pin_load 0.0100 [get_ports {result[0]}]
###############################################################################
# Design Rules
###############################################################################
